# DLした画像の調整を行う
- 重複画像の削除
- 学習用・検証用に分ける

## 重複画像の削除

In [1]:
import os

import pandas as pd

from image_util import delete_duplicate_images, count_images

In [2]:
ROOT_DIR = './images'
display(count_images(ROOT_DIR))

           image
name
CHAEYOUNG    258
DAHYUN       239
JEONGYEON    250
JIHYO        248
MINA         229
MOMO         273
NAYEON       276
SANA         254
TZUYU        419

In [3]:
deleted = delete_duplicate_images(ROOT_DIR)
print(len(deleted))

calc hash: 100% 2446/2446 [00:25<00:00, 96.33it/s]

148

In [4]:
count_images(ROOT_DIR)

           image
name
CHAEYOUNG    258
DAHYUN       231
JEONGYEON    243
JIHYO        243
MINA         225
MOMO         265
NAYEON       255
SANA         243
TZUYU        335